user_tutorial/thermFluidOptFoam/Reference_thermFluid_bend_180deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

// the updated blockMesh (openfoam.com) fails on some meshes with default options;
// it reports report inconsistent number of faces although the mesh is still OK.
// this happens where two 'wedge' blocks with different numbers of cells join in the same
// point/edge.
mergeType points;
checkFaceCorrespondence false;



vertices
(
    
    (0.00000000 0.00000000 -0.10000000) // 0
    (5.00000000 0.00000000 -0.10000000) // 1
    (5.00000000 2.50000000 -0.10000000) // 2
    (0.00000000 2.50000000 -0.10000000) // 3
    (0.00000000 0.00000000 0.00000000) // 4
    (5.00000000 0.00000000 0.00000000) // 5
    (5.00000000 2.50000000 0.00000000) // 6
    (0.00000000 2.50000000 0.00000000) // 7
    (40.00000000 0.00000000 -0.10000000) // 8
    (40.00000000 2.50000000 -0.10000000) // 9
    (40.00000000 0.00000000 0.00000000) // 10
    (40.00000000 2.50000000 0.00000000) // 11
    (40.00000000 7.50000000 -0.10000000) // 12
    (5.00000000 7.50000000 -0.10000000) // 13
    (40.00000000 7.50000000 0.00000000) // 14
    (5.00000000 7.50000000 0.00000000) // 15
    (45.00000000 0.00000000 -0.10000000) // 16
    (45.00000000 2.50000000 -0.10000000) // 17
    (45.00000000 0.00000000 0.00000000) // 18
    (45.00000000 2.50000000 0.00000000) // 19
);

blocks
(
    hex ( 0 1 2 3 4 5 6 7 )
    zone_fluid (51 26 1)  simpleGrading (1 1 1) // 0

    hex ( 1 8 9 2 5 10 11 6 )
    zone_test (351 26 1)  simpleGrading (1 1 1) // 1

    hex ( 2 9 12 13 6 11 14 15 )
    (351 51 1)  simpleGrading (1 1 1) // 2

    hex ( 8 16 17 9 10 18 19 11 )
    zone_fluid (51 26 1)  simpleGrading (1 1 1) // 3
);

edges
(
    
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
            (5 10 11 6)
            (1 8 9 2)
            (6 11 14 15)
            (2 9 12 13)
            (10 18 19 11)
            (8 16 17 9)
            
        );

    }

    symmetry
    {
        type symmetry;
        faces
        (
            (4 5 1 0)
            (5 10 8 1)
            (10 18 16 8)
            
        );

    }

    walls
    {
        type wall;
        faces
        (
            (7 6 2 3)
            (6 2 13 15)
            (15 14 12 13)
            (11 9 12 14)
            (11 19 17 9)
            
        );

    }

    outlet
    {
        type patch;
        faces
        (
            (18 16 17 19)
            
        );

    }

    inlet
    {
        type patch;
        faces
        (
            (4 0 3 7)
            
        );

    }
);

mergePatchPairs
();



faces
();


// ************************************************************************* //
