user_tutorial/thermFluidOptFoam/Reference_thermFluid_bend_180deg/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
nu                    nu [0 2 -1  0 0 0 0]	29.1e-06;	// Viscosity (when nu_temp_dep=0)

// Temperature dependent viscosity controls
nu_temp_dep                                 1;			// Use temperature dependent viscosity? (yes=1)
nu_k                nu_k [0 2 -1  0 0 0 0]	7.0e-05;	// Viscosity at nu_T_ref
nu_n                nu_n [0 0  0  0 0 0 0]	1;			// Fluid behavior index (1 for Newtonian)
nu_slope		nu_slope [0 2 -1 -1 0 0 0]	1.02e-06;	// Slope of viscosity vs. temperature
nu_T_ref        nu_T_ref [0 0  0  1 0 0 0]	313.15;		// Reference temperature
nu_min            nu_min [0 2 -1  0 0 0 0]	1.0e-09;	// Viscosity minimum
nu_max            nu_max [0 2 -1  0 0 0 0]	1.0e-03;	// Viscosity maximum

//// Porosity controls
// Flow resistance (rapidly slows fluid velocity as pseudo density transitions to 0 -> solid)
l_char       	  l_char [0  1  0 0 0 0 0]	0.005;      // Characteristic length
darcy										1.0e-08;    // Darcy number
alpha_scale									5.0e-03;    // Scale factor for early implementation
dalpha		                                10.0;		// Percent increase rate for flow resistance

// RAMP function constant (increases transition rate between fluid and solid)
q_factor                                    1.0e-04;	// Shape factor used to scale ramp function
q_factor_limit                              0.01;		// Shape factor limit
dq_factor                                   2.0;		// Percent increase rate for shape factor (near convergence)
n_rapid                                     10.0;		// Factor that controls when to increase q_factor based on proximity to convergence
