user_tutorial/thermFluidOptFoam/Reference_thermFluid_bend_180deg/0/T_test
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T_test;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 353.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 353.15;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            fixedValue;
        value           uniform 293.15;
    }

    symmetry
    {
        type            symmetry;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
